; domain
(define
	(domain HYRULE)
	(:requirements :adl :typing :universal-preconditions)
	(:types 
		actant portal - entity
		location entity prefab - object
		door entrance - portal
		character item - actant
	)
	(:constants )
	(:predicates
		(at ?x - entity ?y - location)
		(has ?x - character ?y - item)
		(leadsto ?x - entrance ?y - location)
		(connected ?x - location ?y - location)
		(closed ?x - entrance)
		(locked ?x - portal)
		(unlocks ?x - item ?y - portal)
		(doorway ?x - location ?y - location)
		(doorbetween ?x - door ?y - location ?z - location)
		(tutorial-has-been-completed)
		
		(player ?x - character)
		(wants-item ?x - character ?y - item)
		(willing-to-give-item ?x - character ?y - item)
		(prefab ?x - object ?y - prefab)
	)

	(:action talk-to
		:parameters (?speaker - character ?hearer - character ?location - location)
		:precondition
			(and
				(player ?speaker)
				(at ?speaker ?location)
				(at ?hearer ?location)
			)
		:effect
			(and
				(player ?speaker)
				(at ?speaker ?location)
				(at ?hearer ?location)
			)
	)

	(:action look-at
		:parameters (?character - character ?entity - entity ?location - location)
		:precondition
			(and
				(player ?character)
				(at ?character ?location)
				(at ?entity ?location)
			)
		:effect
			(and
				(player ?character)
				(at ?character ?location)
				(at ?entity ?location)
			)
	)

	(:action open
		:parameters (?character - character ?entrance - entrance ?location - location)
		:precondition
			(and
				(player ?character)
				(at ?character ?location)
				(at ?entrance ?location)
				(closed ?entrance)
				(not (locked ?entrance))
			)
		:effect
				(not (closed ?entrance))
	)

	(:action close
		:parameters (?character - character ?entrance - entrance ?location - location)
		:precondition
			(and
				(player ?character)
				(at ?character ?location)
				(at ?entrance ?location)
				(not (closed ?entrance))
				(not (locked ?entrance))
			)
		:effect
				(closed ?entrance)
	)

	(:action pickup
		:parameters (?character - character ?item - item ?location - location)
		:precondition
			(and
				(player ?character)
				(at ?character ?location)
				(at ?item ?location)
			)
		:effect
			(and
				(not (at ?item ?location))
				(has ?character ?item)
				(willing-to-give-item ?character ?item)
			)
	)

	(:action drop
		:parameters (?character - character ?item - item ?location - location)
		:precondition
			(and
				(player ?character)
				(at ?character ?location)
				(has ?character ?item)
				(willing-to-give-item ?character ?item)
			)
		:effect
			(and
				(not (has ?character ?item))
				(at ?item ?location)
				(not (willing-to-give-item ?character ?item))
			)
	)

	(:action give
		:parameters (?sender - character ?item - item ?receiver - character ?location - location)
		:precondition
			(and
				(at ?sender ?location)
				(has ?sender ?item)
				(willing-to-give-item ?sender ?item)
				(at ?receiver ?location)
				(not (has ?receiver ?item))
				(wants-item ?receiver ?item)
			)
		:effect
			(and
				(not (has ?sender ?item))
				(not (willing-to-give-item ?sender ?item))
				(not (wants-item ?receiver ?item))
				(has ?receiver ?item)
			)
	)

	(:action move-through-doorway
		:parameters (?character - character ?from - location ?to - location)
		:precondition
			(and
				(player ?character)
				(at ?character ?from)
				(not (at ?character ?to))
				(connected ?from ?to)
				(doorway ?from ?to)
				(not (= ?from ?to))
			)
		:effect
			(and
				(not (at ?character ?from))
				(at ?character ?to)
			)
	)

	(:action move-through-door
		:parameters (?character - character ?from - location ?door - door ?to - location)
		:precondition
			(and
				(player ?character)
				(at ?character ?from)
				(not (at ?character ?to))
				(not (= ?from ?to))
				(connected ?from ?to)
				(doorbetween ?door ?from ?to)
				(not (locked ?door))
			)
		:effect
			(and
				(not (at ?character ?from))
				(at ?character ?to)
			)
	)

	(:action move-through-entrance
		:parameters (?character - character ?from - location ?entrance - entrance ?to - location)
		:precondition
			(and
				(player ?character)
				(at ?character ?from)
				(not (at ?character ?to))
				(not (= ?from ?to))
				(at ?entrance ?from)
				(leadsto ?entrance ?to)
				(not (closed ?entrance))
			)
		:effect
			(and
				(not (at ?character ?from))
				(at ?character ?to)
			)
	)

	(:action unlock-door
		:parameters (?character - character ?key - item ?door - door)
		:precondition
			(and
				(player ?character)
				(locked ?door)
				(has ?character ?key)
				(unlocks ?key ?door)
			)
		:effect
			(and
				(not (locked ?door))
				(not (has ?character ?key))
			)
	)

	(:action unlock-entrance
		:parameters (?character - character ?key - item ?entrance - entrance ?location - location)
		:precondition
			(and
				(player ?character)
				(locked ?entrance)
				(has ?character ?key)
				(unlocks ?key ?entrance)
				(at ?character ?location)
				(at ?entrance ?location)
			)
		:effect
			(and
				(not (locked ?entrance))
				(not (has ?character ?key))
			)
	)

	(:action donothing
		:parameters (?character - character)
		:precondition
			(and
				(player ?character)
			)
		:effect
				(player ?character)
	)

	(:action win-the-game
		:parameters (?character - character)
		:precondition
			(and
				(player ?character)
			)
		:effect
				
	)
)

; problem
(define (problem rob)
(:domain HYRULE)
	(:objects 
		 basemententrance basementexit barentrance barexit hutentrance hutexit forgeentrance forgeexit shopentrance shopexit bankentrance bankexit fortentrance fortexit mansionentrance mansionexit - entrance
		 junkyard docks bar townarch townsquare hut forge shop bank valley fort cliff mansion basement storage - location
		 player wizard orc riddler quartermaster appraiser fortuneteller knight paladin baron baroness governor majordomo blacksmith banker citizenone citizentwo apprentice barkeep sand woods cave town beach junk woodenhouse brickhouse cliffedge woodendoor gate sword shield ring key coins skull candlestick cupcake contract letter tonic flowers lasso openbook pailofwater glassmirror tinymushroom silverbullion cat - prefab
		 arthur mel alli michael ian giovanna james dorian jordan camille phillip avery peter frank roger dave karina matthias oscar - character
		 towngate - door
		 knightsword knightshield rubyring coin humanskull candle lovecontract tastycupcake shinykey loveletter hairtonic bouquet rope book bucket mirror mushroom silver ash basementexitkey basementbucket - item
	)
	(:init
		(at forgeexit forge)
		(at ian fort)
		(at frank townsquare)
		(at tastycupcake hut)
		(at michael hut)
		(at fortexit fort)
		(at fortentrance valley)
		(at mansionexit mansion)
		(at mansionentrance cliff)
		(at giovanna shop)
		(at forgeentrance townarch)
		(at basementexit basement)
		(at mel bar)
		(at bankentrance townsquare)
		(at shopexit shop)
		(at shopentrance townsquare)
		(at hutexit hut)
		(at hutentrance townarch)
		(at silver bank)
		(at camille fort)
		(at bankexit bank)
		(at alli junkyard)
		(at arthur bar)
		(at phillip fort)
		(at knightsword forge)
		(at basemententrance bar)
		(at matthias forge)
		(at avery mansion)
		(at dave townsquare)
		(at mushroom docks)
		(at book hut)
		(at mirror junkyard)
		(at hairtonic hut)
		(at barexit bar)
		(at peter forge)
		(at karina townarch)
		(at rubyring shop)
		(at knightshield shop)
		(at roger mansion)
		(at bouquet cliff)
		(at dorian townarch)
		(at shinykey bar)
		(at candle mansion)
		(at humanskull cliff)
		(at coin bank)
		(at james valley)
		(at barentrance docks)
		(at oscar bar)
		(at jordan mansion)
		(at bucket fort)
		(at rope forge)
		(closed shopentrance)
		(closed forgeentrance)
		(closed hutentrance)
		(closed bankentrance)
		(closed basemententrance)
		(closed fortentrance)
		(closed barexit)
		(closed mansionentrance)
		(connected townsquare valley)
		(connected townsquare cliff)
		(connected docks junkyard)
		(connected storage basement)
		(connected valley townsquare)
		(connected basement storage)
		(connected docks townarch)
		(connected townarch townsquare)
		(connected cliff townsquare)
		(connected townarch docks)
		(connected junkyard docks)
		(connected townsquare townarch)
		(doorbetween towngate townsquare townarch)
		(doorbetween towngate townarch townsquare)
		(doorway townarch docks)
		(doorway docks junkyard)
		(doorway storage basement)
		(doorway basement storage)
		(doorway docks townarch)
		(doorway valley townsquare)
		(doorway townsquare valley)
		(doorway townsquare cliff)
		(doorway cliff townsquare)
		(doorway junkyard docks)
		(has dorian lovecontract)
		(has dorian loveletter)
		(has alli ash)
		(has mel basementbucket)
		(leadsto forgeexit townarch)
		(leadsto forgeentrance forge)
		(leadsto fortexit valley)
		(leadsto fortentrance fort)
		(leadsto mansionexit cliff)
		(leadsto shopentrance shop)
		(leadsto hutexit townarch)
		(leadsto basementexit bar)
		(leadsto bankexit townsquare)
		(leadsto basemententrance basement)
		(leadsto bankentrance bank)
		(leadsto shopexit townsquare)
		(leadsto barexit docks)
		(leadsto barentrance bar)
		(leadsto mansionentrance mansion)
		(leadsto hutentrance hut)
		(locked bankentrance)
		(player arthur)
		(prefab bank brickhouse)
		(prefab matthias apprentice)
		(prefab oscar barkeep)
		(prefab knightshield shield)
		(prefab coin coins)
		(prefab knightsword sword)
		(prefab ash cat)
		(prefab peter blacksmith)
		(prefab dave citizenone)
		(prefab humanskull skull)
		(prefab townsquare town)
		(prefab candle candlestick)
		(prefab loveletter letter)
		(prefab hairtonic tonic)
		(prefab lovecontract contract)
		(prefab rubyring ring)
		(prefab shop brickhouse)
		(prefab frank banker)
		(prefab basementexitkey key)
		(prefab arthur player)
		(prefab mel wizard)
		(prefab michael fortuneteller)
		(prefab ian quartermaster)
		(prefab alli orc)
		(prefab giovanna appraiser)
		(prefab dorian knight)
		(prefab tastycupcake cupcake)
		(prefab james riddler)
		(prefab camille baroness)
		(prefab phillip baron)
		(prefab roger governor)
		(prefab silver silverbullion)
		(prefab jordan paladin)
		(prefab avery majordomo)
		(prefab bouquet flowers)
		(prefab karina citizentwo)
		(prefab forge woodenhouse)
		(prefab shopexit woodendoor)
		(prefab valley cave)
		(prefab hut woodenhouse)
		(prefab hutexit woodendoor)
		(prefab junkyard junk)
		(prefab shopentrance woodendoor)
		(prefab basement brickhouse)
		(prefab shinykey key)
		(prefab bankentrance woodendoor)
		(prefab bankexit woodendoor)
		(prefab towngate gate)
		(prefab storage brickhouse)
		(prefab mansionentrance woodendoor)
		(prefab mansionexit woodendoor)
		(prefab townarch town)
		(prefab forgeexit woodendoor)
		(prefab bar woodenhouse)
		(prefab fortexit woodendoor)
		(prefab rope lasso)
		(prefab docks beach)
		(prefab cliff cliffedge)
		(prefab basemententrance woodendoor)
		(prefab forgeentrance woodendoor)
		(prefab hutentrance woodendoor)
		(prefab mushroom tinymushroom)
		(prefab fort brickhouse)
		(prefab basementbucket pailofwater)
		(prefab basementexit woodendoor)
		(prefab mansion brickhouse)
		(prefab bucket pailofwater)
		(prefab barentrance woodendoor)
		(prefab book openbook)
		(prefab barexit woodendoor)
		(prefab mirror glassmirror)
		(prefab fortentrance woodendoor)
		(unlocks basementexitkey basementexit)
		(unlocks shinykey bankentrance)
		(wants-item arthur ash)
		(wants-item arthur shinykey)
		(wants-item arthur loveletter)
		(wants-item arthur lovecontract)
		(wants-item arthur basementexitkey)
		(wants-item james coin)
		(wants-item giovanna hairtonic)
		(wants-item james humanskull)
		(wants-item alli tastycupcake)
		(wants-item jordan lovecontract)
		(wants-item jordan loveletter)
		(wants-item james candle)
		(wants-item dorian bouquet)
		(wants-item dorian rubyring)
		(wants-item ian knightshield)
		(wants-item ian knightsword)
		(willing-to-give-item arthur ash)
		(willing-to-give-item arthur lovecontract)
		(willing-to-give-item arthur loveletter)
		(willing-to-give-item dorian lovecontract)
		(willing-to-give-item dorian loveletter)
	)
	(:goal
		(or
			(and
				(has ian knightsword) (has ian knightshield) 
				(has giovanna hairtonic) 
				(has alli tastycupcake) 
			)

			(and
				(has ian knightsword) (has ian knightshield) 
				(has giovanna hairtonic) 
				(has jordan loveletter) (has dorian rubyring) (has dorian bouquet) (has jordan lovecontract) 
			)

			(and
				(has ian knightsword) (has ian knightshield) 
				(has giovanna hairtonic) 
				(has james coin) (has james humanskull) (has james candle) 
			)

			(and
				(has ian knightsword) (has ian knightshield) 
				(has alli tastycupcake) 
				(has jordan loveletter) (has dorian rubyring) (has dorian bouquet) (has jordan lovecontract) 
			)

			(and
				(has ian knightsword) (has ian knightshield) 
				(has alli tastycupcake) 
				(has james coin) (has james humanskull) (has james candle) 
			)

			(and
				(has ian knightsword) (has ian knightshield) 
				(has jordan loveletter) (has dorian rubyring) (has dorian bouquet) (has jordan lovecontract) 
				(has james coin) (has james humanskull) (has james candle) 
			)

			(and
				(has giovanna hairtonic) 
				(has alli tastycupcake) 
				(has jordan loveletter) (has dorian rubyring) (has dorian bouquet) (has jordan lovecontract) 
			)

			(and
				(has giovanna hairtonic) 
				(has alli tastycupcake) 
				(has james coin) (has james humanskull) (has james candle) 
			)

			(and
				(has giovanna hairtonic) 
				(has jordan loveletter) (has dorian rubyring) (has dorian bouquet) (has jordan lovecontract) 
				(has james coin) (has james humanskull) (has james candle) 
			)

			(and
				(has alli tastycupcake) 
				(has jordan loveletter) (has dorian rubyring) (has dorian bouquet) (has jordan lovecontract) 
				(has james coin) (has james humanskull) (has james candle) 
			)

			(and
				(has ian knightsword) (has ian knightshield) 
				(has giovanna hairtonic) 
				(has alli tastycupcake) 
				(has jordan loveletter) (has dorian rubyring) (has dorian bouquet) (has jordan lovecontract) 
			)

			(and
				(has ian knightsword) (has ian knightshield) 
				(has giovanna hairtonic) 
				(has alli tastycupcake) 
				(has james coin) (has james humanskull) (has james candle) 
			)

			(and
				(has ian knightsword) (has ian knightshield) 
				(has giovanna hairtonic) 
				(has jordan loveletter) (has dorian rubyring) (has dorian bouquet) (has jordan lovecontract) 
				(has james coin) (has james humanskull) (has james candle) 
			)

			(and
				(has ian knightsword) (has ian knightshield) 
				(has alli tastycupcake) 
				(has jordan loveletter) (has dorian rubyring) (has dorian bouquet) (has jordan lovecontract) 
				(has james coin) (has james humanskull) (has james candle) 
			)

			(and
				(has giovanna hairtonic) 
				(has alli tastycupcake) 
				(has jordan loveletter) (has dorian rubyring) (has dorian bouquet) (has jordan lovecontract) 
				(has james coin) (has james humanskull) (has james candle) 
			)

			(and
				(has ian knightsword) (has ian knightshield) 
				(has giovanna hairtonic) 
				(has alli tastycupcake) 
				(has jordan loveletter) (has dorian rubyring) (has dorian bouquet) (has jordan lovecontract) 
				(has james coin) (has james humanskull) (has james candle) 
			)

		)
	)

)

; plan
1. (pickup arthur shinykey bar)
   deleted: (at shinykey bar)
   added: (has arthur shinykey) (willing-to-give-item arthur shinykey)
   goals met: 0 of 1
2. (open arthur barexit bar)
   deleted: (closed barexit)
   goals met: 0 of 1
3. (move-through-entrance arthur bar barexit docks)
   deleted: (at arthur bar)
   added: (at arthur docks)
   goals met: 0 of 1
4. (pickup arthur mushroom docks)
   deleted: (at mushroom docks)
   added: (has arthur mushroom) (willing-to-give-item arthur mushroom)
   goals met: 0 of 1
5. (move-through-doorway arthur docks townarch)
   deleted: (at arthur docks)
   added: (at arthur townarch)
   goals met: 0 of 1
6. (give dorian loveletter arthur townarch)
   deleted: (has dorian loveletter) (willing-to-give-item dorian loveletter) (wants-item arthur loveletter)
   added: (has arthur loveletter)
   goals met: 0 of 1
7. (open arthur forgeentrance townarch)
   deleted: (closed forgeentrance)
   goals met: 0 of 1
8. (move-through-entrance arthur townarch forgeentrance forge)
   deleted: (at arthur townarch)
   added: (at arthur forge)
   goals met: 0 of 1
9. (pickup arthur knightsword forge)
   deleted: (at knightsword forge)
   added: (has arthur knightsword) (willing-to-give-item arthur knightsword)
   goals met: 0 of 1
10. (move-through-entrance arthur forge forgeexit townarch)
   deleted: (at arthur forge)
   added: (at arthur townarch)
   goals met: 0 of 1
11. (open arthur hutentrance townarch)
   deleted: (closed hutentrance)
   goals met: 0 of 1
12. (move-through-entrance arthur townarch hutentrance hut)
   deleted: (at arthur townarch)
   added: (at arthur hut)
   goals met: 0 of 1
13. (pickup arthur hairtonic hut)
   deleted: (at hairtonic hut)
   added: (has arthur hairtonic) (willing-to-give-item arthur hairtonic)
   goals met: 0 of 1
14. (pickup arthur tastycupcake hut)
   deleted: (at tastycupcake hut)
   added: (has arthur tastycupcake) (willing-to-give-item arthur tastycupcake)
   goals met: 0 of 1
15. (move-through-entrance arthur hut hutexit townarch)
   deleted: (at arthur hut)
   added: (at arthur townarch)
   goals met: 0 of 1
16. (move-through-door arthur townarch towngate townsquare)
   deleted: (at arthur townarch)
   added: (at arthur townsquare)
   goals met: 0 of 1
17. (open arthur shopentrance townsquare)
   deleted: (closed shopentrance)
   goals met: 0 of 1
18. (move-through-entrance arthur townsquare shopentrance shop)
   deleted: (at arthur townsquare)
   added: (at arthur shop)
   goals met: 0 of 1
19. (give arthur hairtonic giovanna shop)
   deleted: (has arthur hairtonic) (willing-to-give-item arthur hairtonic) (wants-item giovanna hairtonic)
   added: (has giovanna hairtonic)
   goals met: 0 of 1
20. (pickup arthur knightshield shop)
   deleted: (at knightshield shop)
   added: (has arthur knightshield) (willing-to-give-item arthur knightshield)
   goals met: 0 of 1
21. (move-through-entrance arthur shop shopexit townsquare)
   deleted: (at arthur shop)
   added: (at arthur townsquare)
   goals met: 0 of 1
22. (move-through-doorway arthur townsquare valley)
   deleted: (at arthur townsquare)
   added: (at arthur valley)
   goals met: 0 of 1
23. (open arthur fortentrance valley)
   deleted: (closed fortentrance)
   goals met: 0 of 1
24. (move-through-entrance arthur valley fortentrance fort)
   deleted: (at arthur valley)
   added: (at arthur fort)
   goals met: 0 of 1
25. (give arthur knightshield ian fort)
   deleted: (has arthur knightshield) (willing-to-give-item arthur knightshield) (wants-item ian knightshield)
   added: (has ian knightshield)
   goals met: 0 of 1
26. (give arthur knightsword ian fort)
   deleted: (has arthur knightsword) (willing-to-give-item arthur knightsword) (wants-item ian knightsword)
   added: (has ian knightsword)
   goals met: 0 of 1
27. (move-through-entrance arthur fort fortexit valley)
   deleted: (at arthur fort)
   added: (at arthur valley)
   goals met: 0 of 1
28. (move-through-doorway arthur valley townsquare)
   deleted: (at arthur valley)
   added: (at arthur townsquare)
   goals met: 0 of 1
29. (move-through-door arthur townsquare towngate townarch)
   deleted: (at arthur townsquare)
   added: (at arthur townarch)
   goals met: 0 of 1
30. (move-through-doorway arthur townarch docks)
   deleted: (at arthur townarch)
   added: (at arthur docks)
   goals met: 0 of 1
31. (move-through-doorway arthur docks junkyard)
   deleted: (at arthur docks)
   added: (at arthur junkyard)
   goals met: 0 of 1
32. (give arthur tastycupcake alli junkyard)
   deleted: (has arthur tastycupcake) (willing-to-give-item arthur tastycupcake) (wants-item alli tastycupcake)
   added: (has alli tastycupcake)
   goals met: 1 of 1
